loadtest.yml
# https://www.artillery.io/docs/get-started/first-test
config:
  target: https://development.plutomi.com
  phases:
    - duration: 900
      name: Warm up phase
      arrivalRate: 2
      rampTo: 1000
    - duration: 900
      name: Ramp Up
      arrivalRate: 1000
    # - duration: 200
    #   name: Final Ramp Load
    #   arrivalRate: 200
    #   rampTo: 300
    # - duration: 300
    #   arrivalRate: 300
    #   name: Sustained Load

  # Load & configure a couple of useful plugins
  # https://docs.art/reference/extensions
  plugins:
    ensure: {}
    apdex: {}
    metrics-by-endpoint: {}
  apdex:
    threshold: 100
  ensure:
    thresholds:
      - http.response_time.p99: 100
      - http.response_time.p95: 75
scenarios:
  # - name: "Get applicants 5 times"
  #   flow:
  #     - get:
  #         url: "/api/test/get"
  #         qs:
  #           limit: 50
  - name: "Insert"
    flow:
      - get:
          url: "/api/test/post"